#### Terraform Plan Status: success

<details><summary>Show Plan</summary>

```
data.aws_ami.amazon_linux_2023: Reading...
aws_cloudwatch_event_rule.monthly_ml_training: Refreshing state... [id=nba-cap-development-monthly-ml-training]
aws_iam_role.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml]
aws_iam_role.sagemaker_execution: Refreshing state... [id=nba-cap-development-sagemaker-execution]
aws_iam_role.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn]
aws_cloudwatch_event_rule.monthly_etl: Refreshing state... [id=nba-cap-development-monthly-etl]
aws_s3_bucket.data: Refreshing state... [id=nba-cap-development-data]
aws_secretsmanager_secret.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1]
aws_cloudwatch_event_rule.weekly_etl: Refreshing state... [id=nba-cap-development-weekly-etl]
aws_iam_role.lambda_execution: Refreshing state... [id=nba-cap-development-lambda-execution]
aws_vpc.main: Refreshing state... [id=vpc-0b6c5f3947a364991]
aws_iam_role.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn]
aws_iam_role.bastion: Refreshing state... [id=nba-cap-development-bastion-role]
aws_iam_role.step_functions: Refreshing state... [id=nba-cap-development-step-functions]
aws_cloudwatch_event_rule.weekly_ml_predictions: Refreshing state... [id=nba-cap-development-weekly-ml-predictions]
aws_iam_role_policy_attachment.bastion_ssm: Refreshing state... [id=nba-cap-development-bastion-role-20260223231501912800000001]
aws_iam_instance_profile.bastion: Refreshing state... [id=nba-cap-development-bastion-profile]
aws_iam_role_policy_attachment.lambda_basic: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549032400000003]
aws_iam_role_policy_attachment.lambda_vpc: Refreshing state... [id=nba-cap-development-lambda-execution-20260217211549022400000002]
aws_iam_role_policy_attachment.sagemaker_full_access: Refreshing state... [id=nba-cap-development-sagemaker-execution-20260226055128501200000001]
aws_iam_role_policy.lambda_s3_rds: Refreshing state... [id=nba-cap-development-lambda-execution:nba-cap-development-lambda-s3-rds]
aws_lambda_function.transform_data: Refreshing state... [id=nba-cap-development-transform-data]
aws_lambda_function.fetch_data: Refreshing state... [id=nba-cap-development-fetch-data]
aws_s3_object.schema_sql: Refreshing state... [id=db/schema.sql]
aws_lambda_function.validate_data: Refreshing state... [id=nba-cap-development-validate-data]
aws_s3_object.inference_code: Refreshing state... [id=ml/models/code/inference.py]
aws_s3_object.salary_cap_static_data: Refreshing state... [id=static/salary_cap_history.json]
aws_s3_bucket_server_side_encryption_configuration.data: Refreshing state... [id=nba-cap-development-data]
aws_iam_role_policy.sagemaker_custom: Refreshing state... [id=nba-cap-development-sagemaker-execution:nba-cap-development-sagemaker-custom]
aws_s3_object.feature_engineering_code: Refreshing state... [id=ml/code/feature_engineering.py]
aws_s3_bucket_versioning.data: Refreshing state... [id=nba-cap-development-data]
aws_iam_role_policy.step_functions_lambda: Refreshing state... [id=nba-cap-development-step-functions:nba-cap-development-step-functions-lambda]
data.aws_ami.amazon_linux_2023: Read complete after 1s [id=ami-0b8ef021988a1db2b]
aws_security_group.rds: Refreshing state... [id=sg-0d332cdd9de9f1ea8]
aws_security_group.vpc_endpoints: Refreshing state... [id=sg-01985e1e8d1a5b899]
aws_internet_gateway.main: Refreshing state... [id=igw-0043d0b7878bef291]
aws_security_group.bastion: Refreshing state... [id=sg-044703878f38eaf04]
aws_subnet.private_a: Refreshing state... [id=subnet-024001c7e70b8e723]
aws_route_table.private: Refreshing state... [id=rtb-029dd305c3f4ac761]
aws_subnet.private_b: Refreshing state... [id=subnet-066bb8a4e7c4c5f71]
aws_security_group.lambda: Refreshing state... [id=sg-0d348276a26bc3621]
aws_subnet.public: Refreshing state... [id=subnet-0f1c3b45289fc2f33]
aws_route_table.public: Refreshing state... [id=rtb-0f2bcd46b702b9ee0]
aws_route_table_association.public: Refreshing state... [id=rtbassoc-08fac94fecdbb4de3]
aws_instance.bastion: Refreshing state... [id=i-02e02a2a4a3e480d6]
aws_db_subnet_group.main: Refreshing state... [id=nba-cap-development-db-subnet]
aws_vpc_endpoint.secretsmanager: Refreshing state... [id=vpce-0cc2835137bdb4431]
aws_lambda_function.migrate_schema: Refreshing state... [id=nba-cap-development-migrate-schema]
aws_route_table_association.private_a: Refreshing state... [id=rtbassoc-07f35ad4111286f9d]
aws_route_table_association.private_b: Refreshing state... [id=rtbassoc-086f25003cd7ad678]
aws_vpc_endpoint.s3: Refreshing state... [id=vpce-026914add1fbd9388]
aws_security_group_rule.rds_from_bastion: Refreshing state... [id=sgrule-2890896799]
aws_sfn_state_machine.ml_training_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-training-pipeline]
aws_cloudwatch_event_target.monthly_training_target: Refreshing state... [id=nba-cap-development-monthly-ml-training-MonthlyMLTrainingPipeline]
aws_db_instance.main: Refreshing state... [id=db-EKSITIKQZJTCIAMKGGFH4JIJCQ]
null_resource.trigger_schema_migration: Refreshing state... [id=3084102709976954210]
aws_secretsmanager_secret_version.db_credentials: Refreshing state... [id=arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001]
aws_cloudwatch_metric_alarm.rds_cpu: Refreshing state... [id=nba-cap-development-rds-high-cpu]
aws_lambda_function.load_predictions: Refreshing state... [id=nba-cap-development-load-predictions]
aws_lambda_function.load_to_rds: Refreshing state... [id=nba-cap-development-load-to-rds]
aws_sfn_state_machine.etl_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-etl-pipeline]
aws_iam_role_policy.ml_pipeline_sfn: Refreshing state... [id=nba-cap-development-ml-pipeline-sfn:nba-cap-development-ml-pipeline-sfn-policy]
aws_sfn_state_machine.ml_predictions_pipeline: Refreshing state... [id=arn:aws:states:us-east-1:840033527097:stateMachine:nba-cap-development-ml-predictions-pipeline]
aws_cloudwatch_event_target.weekly_predictions_target: Refreshing state... [id=nba-cap-development-weekly-ml-predictions-WeeklyMLPredictionsPipeline]
aws_iam_role_policy.eventbridge_sfn: Refreshing state... [id=nba-cap-development-eventbridge-sfn-ml:nba-cap-development-eventbridge-sfn-policy]
aws_iam_role_policy.eventbridge_step_functions: Refreshing state... [id=nba-cap-development-eventbridge-sfn:nba-cap-development-eventbridge-sfn-policy]
aws_cloudwatch_event_target.weekly_etl_pipeline: Refreshing state... [id=nba-cap-development-weekly-etl-WeeklyETLStateMachine]
aws_cloudwatch_metric_alarm.etl_failures: Refreshing state... [id=nba-cap-development-etl-failures]
aws_cloudwatch_event_target.monthly_etl_pipeline: Refreshing state... [id=nba-cap-development-monthly-etl-MonthlyETLStateMachine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.main will be updated in-place
  ~ resource "aws_db_instance" "main" {
        id                                    = "db-EKSITIKQZJTCIAMKGGFH4JIJCQ"
      - password                              = (sensitive value) -> null
        tags                                  = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (55 unchanged attributes hidden)
    }

  # aws_iam_role_policy.ml_pipeline_sfn will be updated in-place
  ~ resource "aws_iam_role_policy" "ml_pipeline_sfn" {
        id     = "nba-cap-development-ml-pipeline-sfn:nba-cap-development-ml-pipeline-sfn-policy"
        name   = "nba-cap-development-ml-pipeline-sfn-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "lambda:InvokeFunction",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:aws:lambda:us-east-1:840033527097:function:nba-cap-development-load-predictions",
                        ]
                    },
                  ~ {
                      ~ Action   = [
                            # (10 unchanged elements hidden)
                            "sagemaker:StopTransformJob",
                          + "sagemaker:AddTags",
                        ]
                        # (2 unchanged attributes hidden)
                    },
                    {
                        Action   = [
                            "iam:PassRole",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:aws:iam::840033527097:role/nba-cap-development-sagemaker-execution"
                    },
                    # (2 unchanged elements hidden)
                ]
                # (1 unchanged attribute hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.db_credentials must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db_credentials" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-1:840033527097:secret:nba-cap-development-db-credentials-uMFSD1|terraform-20260218013731188500000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260218013731188500000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_security_group.rds will be updated in-place
  ~ resource "aws_security_group" "rds" {
        id                     = "sg-0d332cdd9de9f1ea8"
      ~ ingress                = [
          - {
              - cidr_blocks      = []
              - description      = "PostgreSQL from bastion host"
              - from_port        = 5432
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = [
                  - "sg-044703878f38eaf04",
                ]
              - self             = false
              - to_port          = 5432
            },
            # (1 unchanged element hidden)
        ]
        name                   = "nba-cap-development-rds-sg"
        tags                   = {
            "Environment" = "development"
            "Project"     = "nba-cap"
        }
        # (7 unchanged attributes hidden)
    }

  # aws_vpc_endpoint.ecr_api will be created
  + resource "aws_vpc_endpoint" "ecr_api" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-01985e1e8d1a5b899",
        ]
      + service_name          = "com.amazonaws.us-east-1.ecr.api"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-024001c7e70b8e723",
          + "subnet-066bb8a4e7c4c5f71",
        ]
      + tags                  = {
          + "Environment" = "development"
          + "Name"        = "nba-cap-development-ecr-api-endpoint"
          + "Project"     = "nba-cap"
        }
      + tags_all              = {
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nba-cap-development-ecr-api-endpoint"
          + "Project"     = "nba-cap"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b6c5f3947a364991"
    }

  # aws_vpc_endpoint.ecr_dkr will be created
  + resource "aws_vpc_endpoint" "ecr_dkr" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-01985e1e8d1a5b899",
        ]
      + service_name          = "com.amazonaws.us-east-1.ecr.dkr"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-024001c7e70b8e723",
          + "subnet-066bb8a4e7c4c5f71",
        ]
      + tags                  = {
          + "Environment" = "development"
          + "Name"        = "nba-cap-development-ecr-dkr-endpoint"
          + "Project"     = "nba-cap"
        }
      + tags_all              = {
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nba-cap-development-ecr-dkr-endpoint"
          + "Project"     = "nba-cap"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b6c5f3947a364991"
    }

  # aws_vpc_endpoint.logs will be created
  + resource "aws_vpc_endpoint" "logs" {
      + arn                   = (known after apply)
      + cidr_blocks           = (known after apply)
      + dns_entry             = (known after apply)
      + id                    = (known after apply)
      + ip_address_type       = (known after apply)
      + network_interface_ids = (known after apply)
      + owner_id              = (known after apply)
      + policy                = (known after apply)
      + prefix_list_id        = (known after apply)
      + private_dns_enabled   = true
      + requester_managed     = (known after apply)
      + route_table_ids       = (known after apply)
      + security_group_ids    = [
          + "sg-01985e1e8d1a5b899",
        ]
      + service_name          = "com.amazonaws.us-east-1.logs"
      + service_region        = (known after apply)
      + state                 = (known after apply)
      + subnet_ids            = [
          + "subnet-024001c7e70b8e723",
          + "subnet-066bb8a4e7c4c5f71",
        ]
      + tags                  = {
          + "Environment" = "development"
          + "Name"        = "nba-cap-development-logs-endpoint"
          + "Project"     = "nba-cap"
        }
      + tags_all              = {
          + "Environment" = "development"
          + "ManagedBy"   = "terraform"
          + "Name"        = "nba-cap-development-logs-endpoint"
          + "Project"     = "nba-cap"
        }
      + vpc_endpoint_type     = "Interface"
      + vpc_id                = "vpc-0b6c5f3947a364991"
    }

Plan: 4 to add, 3 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Workspace:** dev
**Environment:** development
